{"meta":{"title":"Cyclics Blog","subtitle":"","description":"","author":"Cyclics","url":"https://cyclics-blog.pages.dev"},"posts":[{"title":"Fantasia Chapter 1","slug":"Fantasia-chapter-1","date":"2021-05-12T04:42:12.000Z","updated":"2021-05-12T04:52:28.970Z","comments":true,"path":"2021/05/12/Fantasia-chapter-1/","link":"","permalink":"https://cyclics-blog.pages.dev/2021/05/12/Fantasia-chapter-1/","excerpt":"","text":"Section 1I sat around wandering for nearly an hour waiting for a sign, maybe from that gentle and deep voice of the prudish middle-aged man sitting on the left side of the door, or maybe that shrill sound screaming from that old witch’s throat blasting out like a machine gun which I’ve heard over and over since I came here. I knew that lady once before but after stepping into this dull and lifeless chamber painted blank all around in this ominous morning I realized that I had to renew my judgment about her. Unlike that prudish man confining himself within behaviors even robots can perfectly perform, she stepped into an opposite polarity we often called garrulous and might never be able to jump out of her repetitive works and her shiftless colleagues, facing their “bosses” - professors in our dying academic department - with that stone-like smile and biding their time talking only about their newly ordered cooking pots. I could not wait any longer due to the killing atmosphere here: the old lady continuously and interminably prated about some housework issues with that robot - forgive me about this nickname - who inevitably fell into the homemaker’s trap simply because he is so impotent and passive to be a communicator never being able to delicately make a digression while pretending to be unconscious, and in the center of the chamber there are some students cliques lay on the round sofa making aimless and inane noise.","raw":null,"content":null,"categories":[],"tags":[{"name":"Fantasia","slug":"Fantasia","permalink":"https://cyclics-blog.pages.dev/tags/Fantasia/"}]},{"title":"Meandering through Jazz Funk","slug":"Meandering-through-Jazz-Funk","date":"2021-05-08T08:09:10.000Z","updated":"2021-05-08T08:25:14.230Z","comments":true,"path":"2021/05/08/Meandering-through-Jazz-Funk/","link":"","permalink":"https://cyclics-blog.pages.dev/2021/05/08/Meandering-through-Jazz-Funk/","excerpt":"","text":"My first impression about Jazz Funk came from the famous album Black and Blues by female Jazz flautist Bobbi Humphrey. She was the first female instrumentalist signed by Blue Note in 1971 and produced her outstanding early albums from Flute In in 1971 to Fancy Dancer in 1975 before she changed her career and was fully devoted into the musical business.","raw":null,"content":null,"categories":[],"tags":[{"name":"Jazz","slug":"Jazz","permalink":"https://cyclics-blog.pages.dev/tags/Jazz/"},{"name":"Funk","slug":"Funk","permalink":"https://cyclics-blog.pages.dev/tags/Funk/"}]}]}